nc: 80  # number of classes
depth_multiple: 0.33  # scale depth
width_multiple: 0.25  # scale width
ch: 3  # input channels

backbone:
  [
    [-1, 1, Conv, [32, 3, 1]],            # 0
    [-1, 1, Conv, [64, 3, 2]],            # 1-P1/2
    [-1, 1, BottleneckCSP, [64, 1]],      # 2
    [-1, 1, Conv, [128, 3, 2]],           # 3-P2/4
    [-1, 1, BottleneckCSP, [128, 1]],     # 4
    [-1, 1, Conv, [256, 3, 2]],           # 5-P3/8
    [-1, 1, BottleneckCSP, [256, 1]],     # 6
    [-1, 1, Conv, [512, 3, 2]],           # 7-P4/16
    [-1, 1, BottleneckCSP, [512, 1]],     # 8
    [-1, 1, SPPF, [512, 5]],              # 9
  ]

head:
  [
    [-1, 1, Conv, [256, 1, 1]],           # 10
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
    [[-1, 6], 1, Concat, [1]],            # 12
    [-1, 1, BottleneckCSP, [256, 1]],     # 13

    [-1, 1, Conv, [128, 1, 1]],           # 14
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
    [[-1, 4], 1, Concat, [1]],            # 16
    [-1, 1, BottleneckCSP, [128, 1]],     # 17

    [-1, 1, Conv, [128, 3, 2]],           # 18
    [[-1, 13], 1, Concat, [1]],           # 19
    [-1, 1, BottleneckCSP, [256, 1]],     # 20

    [-1, 1, Conv, [256, 3, 2]],           # 21
    [[-1, 9], 1, Concat, [1]],            # 22
    [-1, 1, BottleneckCSP, [512, 1]],     # 23

    [[17, 20, 23], 1, Detect, [nc]],      # 24 Detect layers
  ]
