nc: 80
scales:
  n: [0.33, 0.50, 640]
backbone:
  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 2, C2f, [64, True]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 1, C3TR, [512]]
  - [-1, 1, SPPF, [512, 5]]
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C2f, [256]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C2f, [128]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C2f, [256]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, C2f, [512]]
  - [[15, 18, 21], 1, Detect, [nc]]
scale: n
yaml_file: yolov9n.yaml
ch: 3
depth_multiple: 0.33
width_multiple: 0.50

